Revit 2024 API
BuiltInFailures.SketchFailures.CannotDrawExtrusionRoof Property
 Can't make extruded roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotDrawExtrusionRoof { get; }
Visual Basic
Public Shared ReadOnly Property CannotDrawExtrusionRoof As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotDrawExtrusionRoof {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace